import fitz
import pdfplumber
from service.config import Financial_Statement
from db.index import read_table
from service.report import find_standard_unqualified_opinions, gen_hbzcfzb, generate_announcement
from strategy.announcements.announcements import filter_by_increase_in_accounts_receivable

from utils.index import _is_empty, _map

# texts = []
# pdf_url = "test.pdf"
# doc = fitz.open(pdf_url) # open a document
# pdf = pdfplumber.open(pdf_url)
# # for page in doc: # iterate the document pages
# #     # texts.append(page.get_text())

# # print(doc[0])
# # count = 0
# # for index, page in enumerate(doc):
# #     ppage = pdf.pages[index]
# #     for chars in page.get_texttrace():
# #         text = ''
# #         for char in chars['chars']:
# #             text += chr(char[0])
# #         count+=1
# #         bbox = chars['bbox']
# #         pix = page.get_pixmap(clip=bbox)
# #         # print('unicolor: ', pix.is_unicolor)
# #         print(f"【**{text}**】", 'topusage: ', pix.color_topusage()[0])
# #         objects = ppage.crop(bbox=bbox).objects
# #         print('crop rect count: ', len(objects['rect']), 'crop chars: ', _map(objects['char'], lambda item: item['text']))
# #         print("\n")


# for index, page in enumerate(pdf.pages):
#     fixz_page = doc[index]

#     def keep_visible_char(obj):
#         type = obj['object_type']
#         top = obj["top"]
#         bottom = obj["bottom"]
#         x0 = obj["x0"]
#         x1 = obj["x1"]
#         bbox = (x0, top, x1, bottom)

#         if type == 'char':
#             text = obj['text']
#             pix = fixz_page.get_pixmap(clip=bbox)
#             topusage = pix.color_topusage()[0]
#             # page.crop(bbox=bbox)
#             objects = page.crop(bbox=bbox).objects
#             # rects = objects['rect']
#             # chars = objects['char']
#             # chars_text = _map(chars, lambda item: item['text'])

#             print(f"【{text}】", f"topuseage: {topusage}")
#             # print(f"rect count: {len(rects)}", f"char count: {chars_text}")

#         return True

#     # 过滤掉不可见的文本
#     # page = page.filter(keep_visible_char)
#     # page.find_tables()
#     # objects = page.objects

#     objs = page.objects

#     for type in objs:
#         objects = objs[type]
#         if type == 'char':
#             for obj in objects:
#                 text = obj['text']
#                 top = obj["top"]
#                 bottom = obj["bottom"]
#                 x0 = obj["x0"]
#                 x1 = obj["x1"]
#                 w = x1 - x0
#                 h = bottom - top
#                 bbox = (x0, top, x1, bottom)
#                 pix = fixz_page.get_pixmap(clip=bbox)
#                 topusage = pix.color_topusage()[0]
#                 print(f"【{text}】", f"topuseage: {topusage}")
#                 if w > 0 and h > 0:
#                     crop_objects = page.crop(bbox=bbox).objects
#                     rects = crop_objects['rect']
#                     chars = crop_objects['char']
#                     texts = _map(chars, lambda char: char['text'])
#                     print('crop rect count: ', len(rects), 'crop char count: ', len(chars))
#                     print('crop chars: ', texts)

        

# 【**告**】 {'dir': (1.0, 0.0), 'font': 'å®\x8bä½\x93', 'wmode': 0, 'flags': 4, 'bidi_lvl': 0, 'bidi_dir': 2, 'ascender': 0.859375, 'descender': -0.140625, 'colorspace': 3, 'color': (0.0, 0.0, 0.0), 'size': 9.0, 'opacity': 1.0, 'linewidth': 0.45, 'spacewidth': 4.5, 'type': 0, 'chars': ((21578, 2682, (334.0299987792969, 51.9599609375), (334.0299987792969, 44.2255859375, 343.0299987792969, 53.2255859375)),), 'bbox': (334.0299987792969, 44.2255859375, 343.0299987792969, 53.2255859375), 'layer': '', 'seqno': 3}
# unicolor:  False
# topusage:  (0.58, b'\xff\xff\xff')


# 【**告**】 {'dir': (1.0, 0.0), 'font': 'å®\x8bä½\x93', 'wmode': 0, 'flags': 4, 'bidi_lvl': 0, 'bidi_dir': 2, 'ascender': 0.859375, 'descender': -0.140625, 'colorspace': 3, 'color': (0.0, 0.0, 0.0), 'size': 9.0, 'opacity': 1.0, 'linewidth': 0.45, 'spacewidth': 4.5, 'type': 0, 'chars': ((21578, 2682, (277.3699951171875, 63.239990234375), (277.3699951171875, 55.505615234375, 286.3699951171875, 64.505615234375)),), 'bbox': (277.3699951171875, 55.505615234375, 286.3699951171875, 64.505615234375), 'layer': '', 'seqno': 4}
# unicolor:  False
# topusage:  (0.8, b'\xff\xff\xff')

# {'text': '告', 'x0': 277.37, 'top': 55.509000000000015, 'x1': 286.37, 'bottom': 64.50900000000001, 'chars': [{'matrix': (1, 0, 0, 1, 277.37, 778.68), 'fontname': 'ABCDEE+宋体', 'adv': 9.0, 'upright': True, 'x0': 277.37, 'y0': 777.411, 'x1': 286.37, 'y1': 786.411, 'width': 9.0, 'height': 9.0, 'size': 9.0, 'object_type': 'char', 'page_number': 249, 'text': '告', 'stroking_color': 0, 'non_stroking_color': 0, 'top': 55.509000000000015, 'bottom': 64.50900000000001, 'doctop': 194302.269000001}]}

# 'bbox': (277.3699951171875, 55.505615234375, 286.3699951171875, 64.505615234375)
# 'bbox': x0, top, x1, bottom

# text = '第(cid:1212)节 (cid:1948)(cid:2600)简(cid:1275)和(cid:1131)要(cid:17234)务指标 ................................................................................................. 5'
# format = "第二节 公司简介和主要财务指标"
# print(chr(int(17234)))
# file_title_list = [
#     "000021__深科技__2022年年度报告__1216497188",
#     "000066__中国长城__2022年年度报告__1216700847",
#     "000776__广发证券__2022年年度报告__1216280247",
#     "000915__华特达因__2022年年度报告__1216092932",
#     "001227__兰州银行__2022年年度报告__1216741872", #期末（本集团、本银行）、上期末（本集团、本银行）
#     "002799__环球印务__2022年年度报告__1216700574",
#     "002807__江阴银行__2022年年度报告__1216234641",
#     "002936__郑州银行__2022年年度报告__1216278358",
#     "000822__山东海化__2022年年度报告__1216201007",
#     "600016__民生银行__中国民生银行2022年年度报告__1216238250"
# ] 

# filter_by_increase_in_accounts_receivable(file_title_list)
# r = read_table(
#     table_name="announcements",
#     fields=["file_title"],
#     result_type="dict",
#     filter_str=
#     '''
#     where title not like '%H股%' 
#     and title not like '%意见%' 
#     and title not like '%英文%' 
#     and title not like '%取消%' 
#     and title not like '%摘要%' 
#     and title not like '%公告%' 
#     and title not like '%修订前%' 
#     and title not like '%更新前%' 
#     and 
#     (title like '%2022%'
#     or title like '%2021%'
#     or title like '%2020%')
#     ''',
# )
# file_title_list = _map(r, lambda item: item["file_title"]) # ORDER BY RAND() LIMIT 10
# error_list = []
# for file_title in file_title_list:
#     result = find_standard_unqualified_opinions(file_title)
#     if isinstance(result,str):
#         error_list.append(result)
# print("错误列表：",error_list)
# print(len(error_list))
lst = ['002124__天邦食品__2021年年度报告__1213189424', '002125__湘潭电化__2021年年度报告__1212978637', '002126__银轮股份__2021年年度报告全文(更新后)__1212918972', '002127__南极电商__2021年年度报告__1213021635', '002128__电投能源__2021年年度报告__1212922664', '002129__TCL中环__2021年年度报告__1213148815', '002130__沃尔核材__2021年年度报告__1212886183', '002131__利欧股份__2021年年度报告__1213263067', '002132__恒星科技__2021年年度报告__1212727234', '002133__广宇集团__2021年年度报告__1213253386', '002134__天津普林__2021年年度报告__1213137536', '002135__东南网架__2021年年度报告__1212883208', '002136__安纳达__2021年年度报告__1212631848', '002137__实益达__2021年年度报告__1213118771', '002138__顺络电子__2021年年度报告__1212459134', '002139__拓邦股份__2021年年度报告__1212634739', '002140__东华科技__2021年年度报告__1213167209', '002141__贤丰控股__2021年年度报告__1212919115', '002142__宁波银行__2021年年度报告__1212837560', '002144__宏达高科__2021年年度报告__1213053699', '002145__中核钛白__2021年年度报告__1213132213', '002146__荣盛发展__2021年年度报告__1213255153', '002148__北纬科技__2021年年度报告__1212744451', '002149__西部材料__2021年年度报告__1212914438', '002149__西部材料__西部材料2021年年度报告全文（更正后）__1214159977', '002150__通润装备__2021年年度报告__1213205163', '002151__北斗星通__2021年年度报告__1212920491', '002152__广电运通__2021年年度报告(更新后)__1214386112', '002153__石基信息__2021年年度报告__1213176298', '002154__报喜鸟__2021年年度报告__1212943570', '002155__湖南黄金__2021年年度报告__1212634507', '002156__通富微电__2021年年度报告__1212729915', '002157__*ST正邦__2021年年度报告__1213251585', '002158__汉钟精机__2021年年度报告__1213246447', '002159__三特索道__2021年年度报告__1213256572', '002160__常铝股份__2021年年度报告__1213133659', '002161__远望谷__2021年年度报告__1213206644', '002162__悦心健康__2021年年度报告__1213131071', '002163__海南发展__2021年年度报告__1213166065', '002164__宁波东力__2021年年度报告__1213253289', '002165__红宝丽__2021年年度报告__1212940912', '002166__莱茵生物__2021年年度报告__1212924105', '002167__东方锆业__2021年年度报告__1212580626', '002168__惠程科技__2021年年度报告__1213257917', '002169__智光电气__2021年年度报告__1213249481', '002170__芭田股份__2021年年度报告__1213209494', '002171__楚江新材__2021年年度报告__1212919017', '002172__澳洋健康__2021年年度报告__1213214373', '002173__创新医疗__2021年年度报告__1213257131', '002174__游族网络__2021年年度报告__1213263369', '002175__东方智造__2021年年度报告__1212688660', '002176__江特电机__2021年年度报告__1213201355', '002177__御银股份__2021年年度报告全文（更新后）__1217023111', '002178__延华智能__2021年年度报告__1213265491', '002179__中航光电__2021年年度报告（更新后）__1212811420', '002180__纳思达__2021年年度报告__1213167634', '002181__粤传媒__2021年年度报告__1213167431', '002182__云海金属__2021年年度报告__1212578444', '002183__怡亚通__2021年年度报告__1212857969', '002184__海得控制__2021年年度报告__1213213717', '002185__华天科技__2021年年度报告__1213101704', '002186__全聚德__2021年年度报告__1213059454', '002187__广百股份__2021年年度报告__1212685463', '002188__中天服务__2021年年度报告（更新后）__1212633207', '002189__中光学__2021年年度报告__1213142472', '002190__成飞集成__2021年年度报告__1212568774', '002191__劲嘉股份__2021年年度报告__1212942748', '002192__融捷股份__2021年年度报告__1213102931', '002193__如意集团__2021年年度报告__1213213490', '002194__武汉凡谷__2021年年度报告__1212724847', '002195__二三四五__2021年年度报告__1213257308', '002196__方正电机__2021年年度报告__1212924995', '002197__证通电子__2021年年度报告__1213209446', '002198__嘉应制药__2021年年度报告__1212550543', '002199__东晶电子__2021年年度报告__1212939285', '002200__ST交投__2021年年度报告__1213109167', '002200__ST交投__2021年年度报告（更正后）__1213551383', '002201__正威新材__2021年年度报告__1213263148', '002202__金风科技__2021年年度报告__1212688229', '002203__海亮股份__2021年年度报告__1213176212', '002204__大连重工__2021年年度报告__1213027512', '002205__国统股份__2021年年度报告__1213025896', '002206__海利得__2021年年度报告__1212975675', '002207__准油股份__2021年年度报告__1213210865', '002208__合肥城建__2021年年度报告__1212979613', '002209__达意隆__2021年年度报告__1212924371', '002210__飞马国际__2021年年度报告__1213220251', '002211__ST宏达__2021年年度报告__1213267662', '002212__天融信__2021年年度报告__1213220328', '002213__大为股份__2021年年度报告__1213137399', '002214__大立科技__2021年年度报告__1213054342', '002215__诺普信__2021年年度报告__1213141316', '002216__三全食品__2021年年度报告__1212961963', '002217__合力泰__2021年年度报告__1212923152', '002218__拓日新能__2021年年度报告__1213026410', '002219__新里程__2021年年度报告__1213209615', '002221__东华能源__2021年年度报告__1213004778', '002222__福晶科技__2021年年度报告__1213042468', '002223__鱼跃医疗__2021年年度报告__1213059325', '002224__三力士__2021年年度报告全文__1215256085', '002224__三力士__2021年年度报告全文（更新后）__1213573579', '002225__濮耐股份__2021年年度报告__1212974209', '002226__江南化工__2021年年度报告__1212710652', '002227__奥特迅__2021年年度报告__1213145872', '002228__合兴包装__2021年年度报告__1213002324', '002229__鸿博股份__2021年年度报告__1212838648', '002230__科大讯飞__2021年年度报告__1213023838', '002231__奥维通信__2021年年度报告__1212608608', '002232__启明信息__2021年年度报告__1212682475', '002233__塔牌集团__2021年年度报告__1212568195', '002234__民和股份__2021年年度报告__1212685630', '002235__安妮股份__2021年年度报告__1213168501', '002236__大华股份__2021年年度报告__1213056936', '002237__恒邦股份__2021年年度报告全文（更新后）__1214498386', '002237__恒邦股份__2021年年度报告全文（更正后）__1213836579', '002238__天威视讯__2021年年度报告__1212920798', '002239__奥特佳__2021年年度报告__1213263439', '002240__盛新锂能__2021年年度报告__1212710795', '002241__歌尔股份__2021年年度报告__1212730375', '002242__九阳股份__2021年年度报告__1212730075', '002243__力合科创__2021年年度报告__1212650380', '002244__滨江集团__2021年年度报告__1213249284', '002245__蔚蓝锂芯__2021年年度报告__1212634905', '002246__北化股份__2021年年度报告__1213106642', '002247__聚力文化__2021年年度报告全文(更新后）__1213299671', '002248__华东数控__2021年年度报告__1213159173', '002249__大洋电机__2021年年度报告__1213116317', '002250__联化科技__2021年年度报告__1213020444', '002251__步步高__2021年年度报告__1213256098', '002252__上海莱士__2021年年度报告__1213168786', '002253__川大智胜__2021年年度报告__1212669795', '002254__泰和新材__2021年年度报告__1212857634', '002255__海陆重工__2021年年度报告__1212855236', '002255__海陆重工__2021年年度报告（更正后）__1213550837', '002256__兆新股份__2021年年度报告__1212751406', '002258__利尔化学__2021年年度报告__1212508215', '002259__ST升达__2021年年度报告__1213218707', '002261__拓维信息__2021年年度报告__1213170560', '002262__恩华药业__2021年年度报告__1212685521', '002263__大东南__2021年年度报告__1213131493', '002264__新华都__2021年年度报告__1212729571', '002265__西仪股份__2021年年度报告__1212742504', '002266__浙富控股__2021年年度报告__1213259364', '002267__陕天然气__2021年年度报告__1212886675', '002268__电科网安__2021年年度报告__1213028832', '002269__美邦服饰__2021年年度报告__1213263000', '002270__华明装备__2021年年度报告__1213022683', '002270__华明装备__2021年年度报告（修订稿）__1213571762', '002271__东方雨虹__2021年年度报告__1212886771', '002272__川润股份__2021年年度报告__1212745653', '002273__水晶光电__2021年年度报告__1212533829', '002274__华昌化工__2021年年度报告__1213017975', '002275__桂林三金__2021年年度报告__1213129347', '002276__万马股份__2021年年度报告__1212918044', '002277__友阿股份__2021年年度报告__1213248134', '002278__神开股份__2021年年度报告__1213249608', '002278__神开股份__2021年年度报告（更正后）__1213835589', '002279__久其软件__2021年年度报告__1213056241', '002280__联络互动__2021年年度报告__1213211051', '002280__联络互动__2021年年度报告全文（更正后）__1213300700', '002281__光迅科技__2021年年度报告__1212918512', '002282__博深股份__2021年年度报告__1213099404', '002283__天润工业__2021年年度报告__1212568859', '002284__亚太股份__2021年年度报告__1212976384', '002285__世联行__2021年年度报告__1212898802', '002286__保龄宝__2021年年度报告__1213205314', '002287__奇正藏药__2021年年度报告__1213194546', '002288__超华科技__2021年年度报告__1212754689', '002289__ST宇顺__2021年年度报告__1212841246', '002290__禾盛新材__2021年年度报告__1212836874', '002291__遥望科技__2021年年度报告__1213259401', '002292__奥飞娱乐__2021年年度报告__1213262999', '002293__罗莱生活__2021年年度报告__1212983510', '002294__信立泰__2021年年度报告__1212711809', '002295__精艺股份__2021年年度报告__1212964652', '002296__辉煌科技__2021年年度报告__1212922740', '002297__博云新材__2021年年度报告__1213053957', '002298__中电兴发__2021年年度报告__1213170379', '002299__圣农发展__2021年年度报告__1213004638', '002300__太阳电缆__2021年年度报告__1212749329', '002301__齐心集团__2021年年度报告__1213261705', '002302__西部建设__2021年年度报告__1212808904', '002303__美盈森__2021年年度报告__1213206206', '002304__洋河股份__2021年年度报告__1213205691', '002305__南国置业__2021年年度报告__1213060532', '002306__中科云网__2021年年度报告__1212610203', '002307__北新路桥__2021年年度报告__1212979270', '002308__威创股份__2021年年度报告__1213164375', '002308__威创股份__2021年年度报告全文（更正后）__1214109862', '002309__ST中利__2021年年度报告__1213137834', '002310__东方园林__2021年年度报告__1213148865', '002311__海大集团__2021年年度报告__1212885355', '002312__川发龙蟒__2021年年度报告__1212898346', '002313__*ST日海__2021年年度报告__1213267491', '002314__南山控股__2021年年度报告__1213245602', '002315__焦点科技__2021年年度报告（更新后）__1213570179', '002316__亚联发展__2021年年度报告（更新后）__1214587045', '002317__众生药业__2021年年度报告__1213106368', '002318__久立特材__2021年年度报告__1213103407', '002319__乐通股份__2021年年度报告__1212753424', '002320__海峡股份__2021年年度报告__1212541367', '002321__华英农业__2021年年度报告__1213266621', '002322__理工能科__2021年年度报告__1213053197', '002323__雅博股份__2021年年度报告__1212511313', '002324__普利特__2021年年度报告__1212568022', '002325__洪涛股份__2021年年度报告__1213264572', '002326__永太科技__2021年年度报告__1213049944', '002327__富安娜__2021年年度报告__1213059647', '002328__新朋股份__2021年年度报告__1213053538', '002329__皇氏集团__2021年年度报告__1213176683', '002329__皇氏集团__皇氏集团股份有限公司2021年年度报告__1213357780', '002329__皇氏集团__皇氏集团股份有限公司2021年年度报告__1213357781', '002330__得利斯__2021年年度报告__1212999765', '002331__皖通科技__2021年年度报告__1213131464', '002332__仙琚制药__2021年年度报告__1212999588', '002333__罗普斯金__2021年年度报告__1213145032', '002334__英威腾__2021年年度报告__1213142669', '002335__科华数据__2021年年度报告__1213261604', '002336__人人乐__2021年年度报告__1212923243', '002337__赛象科技__2021年年度报告__1212957778', '002338__奥普光电__2021年年度报告__1213205298', '002339__积成电子__2021年年度报告__1213048561', '002340__格林美__2021年年度报告__1213176561', '002341__新纶新材__2021年年度报告__1213166904', '002342__巨力索具__2021年年度报告__1212723902', '002342__巨力索具__巨力索具股份有限公司2021年度报告全文（更正后）__1212725406', '002343__慈文传媒__2021年年度报告__1213131758', '002344__海宁皮城__2021年年度报告__1212944984', '002345__潮宏基__2021年年度报告__1213257183', '688310__迈得医疗__迈得医疗工业设备股份有限公司2021年年度报告__1213106908', '688310__迈得医疗__迈得医疗工业设备股份有限公司2021年年度报告__1213185113', '688311__盟升电子__2021年年度报告-修订稿__1213106957', '688311__盟升电子__2021年年度报告__1213059274', '688312__燕麦科技__燕麦科技2021年年度报告__1212965257', '688313__仕佳光子__2021年年度报告__1213061448', '688313__仕佳光子__2021年年度报告（修订版）__1213481507', '688314__康拓医疗__西安康拓医疗技术股份有限公司2021年年度报告__1212670042', '688315__诺禾致源__北京诺禾致源科技股份有限公司2021年年度报告__1212898526', '688316__青云科技__2021年年度报告__1213182492', '688316__青云科技__2021年年度报告（更新后）__1213622610', '688317__之江生物__2021年年度报告__1213018623', '688318__财富趋势__财富趋势2021年度报告__1212964605', '688319__欧林生物__成都欧林生物科技股份有限公司2021年年度报告__1213182518', '688321__微芯生物__2021年年度报告全文__1212725379', '688323__瑞华泰__瑞华泰：2021年年度报告__1212724028', '688328__深科达__2021年年度报告__1213273586', '688329__艾隆科技__艾隆科技2021年年度报告__1213273615', '688330__宏力达__宏力达2021年年度报告__1212882620', '688333__铂力特__西安铂力特增材技术股份有限公司2021年年度报告__1212897947', '688335__复洁环保__2021年年度报告__1213045606', '688335__复洁环保__2021年年度报告（修订版）__1213432603', '688336__三生国健__三生国健：2021年年度报告__1212712311', '688338__赛科希德__赛科希德2021年年度报告__1213021244', '688339__亿华通__亿华通  2021年年度报告全文__1212923903', '688339__亿华通__亿华通  2021年年度报告全文（修订版）__1213531795', '688345__博力威__广东博力威科技股份有限公司2021年年度报告__1212978759', '688350__富淼科技__江苏富淼科技股份有限公司2021年年度报告__1212564864', '688355__明志科技__明志科技2021年年度报告__1213221812', '688355__明志科技__明志科技2021年年度报告（修订版）__1213337333', '688356__键凯科技__2021年年度报告__1212711585', '688356__键凯科技__2021年年度报告（修订版）__1212747308', '688357__建龙微纳__2021年年度报告__1212535676', '688358__祥生医疗__无锡祥生医疗科技股份有限公司2021年年度报告__1212962195', '688358__祥生医疗__无锡祥生医疗科技股份有限公司2021年年度报告（修订版）__1213226657', '688359__三孚新科__三孚新科：2021年年度报告__1213026599', '688360__德马科技__德马科技2021年年度报告__1212951655', '688363__华熙生物__华熙生物2021年年度报告__1212541840', '688365__光云科技__光云科技：2021年年度报告__1212839954', '688366__昊海生科__上海昊海生物科技股份有限公司2021年年度报告__1212709917', '688367__工大高科__工大高科2021年年度报告__1213146122', '688368__晶丰明源__上海晶丰明源半导体股份有限公司2021年年度报告__1212444762', '688368__晶丰明源__上海晶丰明源半导体股份有限公司2021年年度报告（修订版）__1214940185', '688369__致远互联__北京致远互联软件股份有限公司2021年年度报告__1212898910', '688377__迪威尔__迪威尔2021年年度报告__1213017251', '688378__奥来德__2021年年度报告__1213019103', '688379__华光新材__华光新材2021年年度报告__1213110125', '688379__华光新材__华光新材2021年年度报告（修订版）__1213621108', '688383__新益昌__深圳新益昌科技股份有限公司2021年年度报告__1213121901', '688385__复旦微电__2021年年度报告__1212628937', '688386__泛亚微透__泛亚微透2021年年度报告__1212747339', '688386__泛亚微透__泛亚微透2021年年度报告（修订版）__1213674047', '688388__嘉元科技__广东嘉元科技股份有限公司2021年年度报告__1212670343', '688388__嘉元科技__广东嘉元科技股份有限公司2021年年度报告（修订版）__1213290347', '688389__普门科技__深圳普门科技股份有限公司2021年年度报告__1212943466', '688390__固德威__2021年年度报告__1213103662', '688390__固德威__2021年年度报告（修订版）__1213619363', '688393__安必平__2021年年度报告__1212811062', '688395__正弦电气__2021年年度报告__1212999635', '688396__华润微__华润微：2021年年度报告__1213061271', '688398__赛特新材__赛特新材：2021年年度报告__1212898751', '688399__硕世生物__江苏硕世生物科技股份有限公司2021年年度报告__1212922404', '688408__中信博__中信博2021年年度报告全文__1213174581', '688408__中信博__中信博2021年年度报告全文（修订版）__1213571931', '688418__震有科技__2021年年度报告全文__1213226686', '688418__震有科技__2021年年度报告全文（修订版）__1213500972', '688425__铁建重工__中国铁建重工集团股份有限公司2021年年度报告__1212743648', '688456__有研粉材__2021年度报告__1213026629', '688466__金科环境__金科环境：2021年年度报告__1213182549', '688468__科美诊断__科美诊断技术股份有限公司2021年年度报告__1213165730', '688468__科美诊断__科美诊断技术股份有限公司2021年年度报告（修订版）__1213413246', '688488__艾迪药业__艾迪药业2021年年度报告__1212924684', '688499__利元亨__广东利元亨智能装备股份有限公司2021年年度报告__1212841448', '688500__*ST慧辰__慧辰股份2021年年度报告__1213273673', '688500__*ST慧辰__慧辰股份2021年年度报告（修订版）__1213480790', '688501__青达环保__青岛达能环保设备股份有限公司2021年年度报告__1212632071', '688505__复旦张江__复旦张江2021年年度报告__1212710389', '688508__芯朋微__2021年年度报告__1212610106', '688509__正元地信__正元地信2021年年度报告__1213106989', '688510__航亚科技__无锡航亚科技股份有限公司2021年年度报告__1213137591', '688510__航亚科技__无锡航亚科技股份有限公司2021年年度报告（修订版）__1213530143', '688511__天微电子__2021年年度报告__1212699120', '688513__苑东生物__苑东生物：2021年年度报告__1212712001', '688516__奥特维__无锡奥特维科技股份有限公司2021年年度报告__1212924884', '688517__金冠电气__金冠电气股份有限公司2021年年度报告__1212944275', '688518__联赢激光__深圳市联赢激光股份有限公司2021年年度报告__1212964133', '688519__南亚新材__南亚新材2021年年度报告__1212924936', '688520__神州细胞__神州细胞2021年年度报告__1213146741', '688521__芯原股份__2021年年度报告__1212730719', '688526__科前生物__武汉科前生物股份有限公司2021年年度报告__1212957253', '688528__秦川物联__2021年年度报告__1213162269', '688528__秦川物联__2021年年度报告（修订版）__1213479273', '688529__豪森股份__豪森股份2021年年度报告__1213226986', '688529__豪森股份__豪森股份2021年年度报告（修订版）__1213548491', '688533__上声电子__上声电子：2021年年度报告__1213182572', '688536__思瑞浦__2021年年度报告__1212557875', '688538__和辉光电__上海和辉光电股份有限公司2021年年度报告__1213182638', '688550__瑞联新材__2021年年度报告__1212951691', '688551__科威尔__2021年年度报告__1212942236', '688551__科威尔__2021年年度报告（修订版）__1213309551', '688553__汇宇制药__四川汇宇制药股份有限公司2021年年度报告__1212828946', '688555__退市泽达__2021年年度报告__1213273749', '688555__退市泽达__2021年年度报告（修订版）__1213441047', '688556__高测股份__2021年年度报告__1213208286', '688557__兰剑智能__兰剑智能科技股份有限公司2021年年度报告__1212744270', '688558__国盛智科__国盛智科2021年年度报告__1212897078', '688559__海目星__2021年年度报告（修订稿）__1213589182', '688559__海目星__海目星：2021年年度报告__1213182681', '688560__明冠新材__明冠新材料股份有限公司2021年年度报告__1213148529', '688561__奇安信__奇安信2021年年度报告__1213121945', '688565__力源科技__力源科技：2021年年度报告__1212984086', '688565__力源科技__力源科技：2021年年度报告（修订后）__1214969397', '688565__力源科技__力源科技：2021年年度报告（修订版）__1213371154', '688565__力源科技__力源科技：2021年年度报告（更正后）__1216740946', '688566__吉贝尔__吉贝尔2021年年度报告__1213174742', '688567__孚能科技__孚能科技2021年年度报告全文__1213273773', '688568__中科星图__中科星图股份有限公司2021年年度报告__1212898548', '688569__铁科轨道__铁科轨道2021年年度报告__1212721657', '688571__杭华股份__杭华油墨股份有限公司2021年年度报告__1212914066', '688575__亚辉龙__2021年年度报告__1213202723', '688577__浙海德曼__浙海德曼2021年年度报告__1213137641', '688578__艾力斯__上海艾力斯医药科技股份有限公司2021年年度报告__1213146137', '688578__艾力斯__上海艾力斯医药科技股份有限公司2021年年度报告（更正后）__1214232654', '688579__山大地纬__山大地纬2021年年度报告__1212899410', '688580__伟思医疗__南京伟思医疗科技股份有限公司2021年年度报告__1213174768', '688585__上纬新材__上纬新材料科技股份有限公司2021年年度报告__1212769669', '688586__江航装备__江航装备2021年年度报告__1212567634', '688588__凌志软件__凌志软件2021年年度报告__1212839995', '688589__力合微__2021年年度报告(更正后)__1214333332', '688589__力合微__2021年年度报告__1212650721', '688590__新致软件__2021年年度报告__1213221949', '688595__芯海科技__芯海科技2021年年度报告__1213182752', '688596__正帆科技__上海正帆科技股份有限公司2021年年度报告__1213183916', '688597__煜邦电力__2021年年度报告全文__1213133015', '688597__煜邦电力__2021年年度报告（修订版）__1213459552', '688598__金博股份__金博股份2021年年度报告__1212458859', '688599__天合光能__天合光能股份有限公司2021年年度报告__1213183956', '688599__天合光能__天合光能股份有限公司2021年年度报告（修订版）__1213612954', '688600__皖仪科技__2021年年度报告__1212534779', '688601__力芯微__2021年年度报告__1212882754', '688606__奥泰生物__2021年年度报告__1213166270', '688607__康众医疗__康众医疗2021年年度报告__1213226716', '688608__恒玄科技__2021年年度报告__1212923954', '688609__九联科技__广东九联科技股份有限公司2021年年度报告__1213166285', '688609__九联科技__广东九联科技股份有限公司2021年年度报告（修订版）__1213463639', '688611__杭州柯林__杭州柯林电气股份有限公司2021年年度报告__1212983216', '688613__奥精医疗__奥精医疗：2021年年度报告__1213174785', '688616__西力科技__杭州西力智能科技股份有限公司2021年年度报告__1213133612', '688617__惠泰医疗__2021年年度报告__1212541782', '688618__三旺通信__2021年年度报告__1213059514', '688619__罗普特__罗普特科技集团股份有限公司2021年年度报告__1212959432', '688621__阳光诺和__阳光诺和2021年年度报告__1212463146', '688622__禾信仪器__2021年年度报告__1213107014', '688625__呈和科技__2021年年度报告__1213146462', '688626__翔宇医疗__翔宇医疗2021年年度报告__1213174864', '688628__优利德__2021年年度报告__1213184011', '688630__芯碁微装__2021年年度报告__1213174866', '688633__星球石墨__2021年年度报告__1213166325', '688636__智明达__成都智明达2021年年度报告全文__1212838564', '688639__华恒生物__安徽华恒生物科技股份有限公司2021年年度报告__1212974136', '688655__迅捷兴__深圳市迅捷兴科技股份有限公司2021年年度报告__1213022211', '688656__浩欧博__江苏浩欧博生物医药股份有限公司2021年年度报告__1213087129', '688658__悦康药业__2021年年度报告__1213226767', '688659__元琛科技__安徽元琛环保科技股份有限公司2021年年度报告__1212727795', '688660__电气风电__上海电气风电集团股份有限公司2021年年度报告__1212710511', '688661__和林微纳__2021年年度报告__1212750677', '688661__和林微纳__和林微纳2021年年度报告（更新稿）__1213184046', '688662__富信科技__广东富信科技股份有限公司2021年年度报告__1212699160', '688663__新风光__新风光电子科技股份有限公司2021年年度报告__1212881675', '688665__四方光电__四方光电股份有限公司2021年年度报告__1212983540', '688667__菱电电控__菱电电控2021年度报告__1213166366', '688667__菱电电控__菱电电控2021年度报告（修订后）__1214331568', '688668__鼎通科技__2021年年度报告__1212729388', '688669__聚石化学__2021年年度报告__1213226784', '688669__聚石化学__2021年年度报告（修订版）__1213632078', '688670__金迪克__江苏金迪克生物技术股份有限公司2021年年度报告__1212853779', '688676__金盘科技__2021年年度报告__1212944863', '688677__海泰新光__青岛海泰新光科技股份有限公司2021年年度报告全文__1213103687', '688678__福立旺__2021年年度报告__1213184115', '688679__通源环境__2021年年度报告__1212975050', '688680__海优新材__上海海优威新材料股份有限公司2021年年度报告 【更正版】__1213762307', '688680__海优新材__上海海优威新材料股份有限公司2021年年度报告__1213107078', '688681__科汇股份__2021年年度报告__1212978515', '688682__霍莱沃__霍莱沃2021年度报告__1213273829', '688683__莱尔科技__2021年年度报告__1213184177', '688685__迈信林__江苏迈信林航空科技股份有限公司2021年年度报告__1213122004', '688685__迈信林__江苏迈信林航空科技股份有限公司2021年年度报告（修订版）__1213309184', '688686__奥普特__2021年年度报告__1212725185', '688687__凯因科技__凯因科技2021年年度报告__1213000714', '688689__银河微电__2021年年度报告__1212566117', '688690__纳微科技__苏州纳微科技股份有限公司2021年年度报告__1212541438', '688696__极米科技__2021年年度报告全文__1213018646', '688696__极米科技__2021年年度报告（修订版）__1213226828', '688697__纽威数控__纽威数控2021年年度报告__1212707170', '688698__伟创电气__苏州伟创电气科技股份有限公司2021年年度报告__1212951704', '688699__明微电子__2021年年度报告__1212922429', '688700__东威科技__2021年年度报告__1212939365', '688701__卓锦股份__2021年年度报告（更正后）.__1215468859', '688701__卓锦股份__浙江卓锦环保科技股份有限公司2021年年度报告__1213221980', '688707__振华新材__贵州振华新材料股份有限公司2021年年度报告__1212841348', '688711__宏微科技__江苏宏微科技股份有限公司2021年年度报告__1213273883', '688711__宏微科技__江苏宏微科技股份有限公司2021年年度报告（更正后）__1213720015', '688718__唯赛勃__上海唯赛勃环保科技股份有限公司2021年年度报告__1213122025', '688722__同益中__同益中2021年年度报告__1212753801', '688728__格科微__格科微有限公司2021年年度报告__1213185263', '688733__壹石通__壹石通2021年年度报告__1212671468', '688737__中自科技__中自环保科技股份有限公司2021年年度报告__1213185312', '688737__中自科技__中自环保科技股份有限公司2021年年度报告（修订版）__1213462060', '688739__成大生物__成大生物2021年年度报告__1212922469', '688766__普冉股份__普冉半导体（上海）股份有限公司2021年年度报告__1212922506', '688767__博拓生物__杭州博拓生物科技股份有限公司2021年年度报告全文__1213174967', '688768__容知日新__容知日新2021年年度报告__1212922528', '688772__珠海冠宇__2021年年度报告__1212961819', '688776__国光电气__国光电气2021年年度报告__1212568130', '688776__国光电气__国光电气2021年年度报告__1212568131', '688777__中控技术__浙江中控技术股份有限公司2021年年度报告__1212887399', '688778__厦钨新能__厦门厦钨新能源材料股份有限公司2021年年度报告__1212754567', '688779__长远锂科__湖南长远锂科股份有限公司2021年年度报告__1212730797', '688786__悦安新材__江西悦安新材料股份有限公司2021年年度报告__1212922549', '688787__海天瑞声__海天瑞声2021年年度报告__1213226858', '688787__海天瑞声__海天瑞声2021年年度报告（更新稿）__1213552864', '688788__科思科技__2021年年度报告__1213185388', '688789__宏华数科__杭州宏华数码科技股份有限公司2021年年度报告__1212885259', '688793__倍轻松__2021年年度报告__1213087151', '688798__艾为电子__艾为电子2021年年度报告__1212944410', '688798__艾为电子__艾为电子2021年年度报告（更新后）__1214160334', '688799__华纳药厂__2021年年度报告__1212711720', '688800__瑞可达__2021年年度报告__1212840032', '688819__天能股份__天能电池集团股份有限公司2021年年度报告__1212753861', '688981__中芯国际__中芯国际2021年年度报告__1212750692', '689009__九号公司__九号有限公司2021年年度报告__1213110211', '830799__艾融软件__2021年年度报告__1213056630', '830832__齐鲁华信__2021年年度报告__1213005339', '830839__万通液压__2021年年度报告__1213208512', '830839__万通液压__2021年年度报告（更正后）__1213590834', '830946__森萱医药__2021年年度报告__1212726700', '830964__润农节水__2021年年度报告__1212744051', '831010__凯添燃气__2021年年度报告__1212965994', '831039__国义招标__2021年年度报告__1213052506', '831305__海希通讯__2021年年度报告__1212769925', '831305__海希通讯__2021年年度报告（更正后）__1213306676', '831370__新安洁__2021年年度报告__1213050742', '831445__龙竹科技__2021年年度报告__1212983624', '831689__克莱特__2021年年度报告__1212825522', '831689__克莱特__2021年年度报告（更正后）__1213139493', '831726__朱老六__2021年年度报告__1213199497', '831768__拾比佰__2021年年度报告__1213131749', '831832__科达自控__2021年年度报告__1213002261', '831832__科达自控__2021年年度报告（更正后）__1213632086', '831856__浩淼科技__2021年年度报告__1213136704', '831961__创远信科__2021年年度报告__1212884423', '832000__安徽凤凰__2021年年度报告__1212827584', '832089__禾昌聚合__2021年年度报告__1213133028', '832145__恒合股份__2021年年度报告__1213170632', '832171__志晟信息__2021年年度报告__1213274694', '832225__利通科技__2021年年度报告__1212578477', '832225__利通科技__2021年年度报告（更正后）__1213587158', '832278__鹿得医疗__2021年年度报告__1213199493', '832317__观典防务__2021年年度报告__1212997924', '832419__路斯股份__2021年年度报告__1212999451', '832566__梓橦宫__2021年年度报告__1213104921', '832566__梓橦宫__2021年年度报告（更正后）__1213432532', '832735__德源药业__2021年年度报告__1212745786', '832885__星辰科技__2021年年度报告__1212740441', '832885__星辰科技__2021年年度报告（更正后）__1213705359', '833266__生物谷__2021年年度报告__1213274675', '833346__威贸电子__2021年年度报告__1213208513', '833346__威贸电子__2021年年度报告（更正后）__1213675495', '833427__华维设计__2021年年度报告__1212962983', '833454__同心传动__2021年年度报告__1213001095', '833509__同惠电子__2021年年度报告__1213128648', '833523__德瑞锂电__2021年年度报告__1213042359', '833819__颖泰生物__2021年年度报告__1212625576', '833873__中设咨询__2021年年度报告__1213127757', '833874__泰祥股份__2021年年度报告__1212912287', '833994__翰博高新__2021年年度报告__1213274731', '834021__流金科技__2021年年度报告__1212743036', '834021__流金科技__2021年年度报告（更正后）__1213434325', '834415__恒拓开源__2021年年度报告__1213212903', '834475__三友科技__2021年年度报告__1213141734', '834599__同力股份__2021年年度报告__1212962986', '834682__球冠电缆__2021年年度报告__1212740453', '834765__美之高__2021年年度报告__1213208177', '835174__五新隧装__2021年年度报告__1213106425', '835179__凯德石英__2021年年度报告__1212900856', '835184__国源科技__2021年年度报告__1213098143', '835184__国源科技__2021年年度报告（更正后）__1213722298', '835185__贝特瑞__2021年年度报告__1212755003', '835305__云创数据__2021年年度报告__1213171589', '835368__连城数控__2021年年度报告__1213160106', '835508__殷图网联__2021年年度报告__1213214588', '835640__富士达__2021年年度报告__1212745783', '835670__数字人__2021年年度报告__1213044366', '836077__吉林碳谷__2021年年度报告__1212962784', '836149__旭杰科技__2021年年度报告__1213203692', '836239__长虹能源__2021年年度报告__1213043577', '836260__中寰股份__2021年年度报告__1213131751', '836263__中航泰达__2021年年度报告__1213141067', '836263__中航泰达__2021年年度报告（更正后）__1213837072', '836433__大唐药业__2021年年度报告__1213171434', '836675__秉扬科技__2021年年度报告__1212700589', '836720__吉冈精密__2021年年度报告__1212885299', '836826__盖世食品__2021年年度报告__1212550988', '836892__广咨国际__2021年年度报告__1212769955', '837092__汉鑫科技__2021年年度报告__1212975332', '837212__智新电子__2021年年度报告__1213129468', '837242__建邦科技__2021年年度报告__1213167930', '837344__三元基因__2021年年度报告__1212943155', '838030__德众汽车__2021年年度报告__1213029319', '838163__方大新材__2021年年度报告__1213135397', '838275__驱动力__2021年年度报告__1212754961', '838924__广脉科技__2021年年度报告__1213100336', '839167__同享科技__2021年年度报告__1212857885', '839680__广道数字__2021年年度报告__1212995502', '839729__永顺生物__2021年年度报告__1212654504', '839946__华阳变速__2021年年度报告__1213199514', '839946__华阳变速__2021年年度报告（更正后）__1213720555', '870204__沪江材料__2021年年度报告__1213138055', '870436__大地电气__2021年年度报告__1212978211', '871245__威博液压__2021年年度报告__1212827622', '871245__威博液压__2021年年度报告（更正后）__1213051121', '871396__常辅股份__2021年年度报告__1212939094', '871553__凯腾精工__2021年年度报告__1212700556', '871553__凯腾精工__2021年年度报告（更正后）__1213300423', '871642__通易航天__2021年年度报告__1213198266', '871857__泓禧科技__2021年年度报告__1212612565', '871981__晶赛科技__2021年年度报告__1213098096', '872925__锦好医疗__2021年年度报告__1212713129', '873169__七丰精工__2021年年度报告__1213148296', '873169__七丰精工__2021年年度报告（更正后）__1214191774']
generate_announcement(
    announcement_type=Financial_Statement.合并资产负债表,
    file_title_list=lst,
    gen_table=gen_hbzcfzb,
    use_cache=True,
    consider_table=False,
)