from strategy.announcements.announcements import filter_by_interest_bearing_liabilities

file_title_list = [
    "600481__双良节能__双良节能系统股份有限公司2022年年度报告__1216560014",
    "003005__竞业达__2022年年度报告__1216617405",
    "301098__金埔园林__2022年年度报告__1216558940",
    "002500__山西证券__2022年年度报告__1216656433",
    "002282__博深股份__2022年年度报告__1216648090",
    "603985__恒润股份__江阴市恒润重工股份有限公司2022年年度报告__1216419056",
    "002581__未名医药__2022年度报告（更正后）__1217066287",
    "688227__品高股份__2022年年度报告__1216711726",
    "601788__光大证券__光大证券股份有限公司2022年年度报告__1216279948",
    "003040__楚天龙__2022年年度报告__1216275830",
    "300668__杰恩设计__2022年年度报告__1216517939",
    "600278__东方创业__东方创业2022年度报告__1216701140",
    "831305__海希通讯__2022年年度报告（更正后）__1216861207",
    "300097__智云股份__2022年年度报告（更新后）__1216921699",
    "603167__渤海轮渡__渤海轮渡集团股份有限公司2022年年度报告__1216441667",
    "688510__航亚科技__无锡航亚科技股份有限公司2022年年度报告__1216582882",
    "688288__鸿泉物联__鸿泉物联：2022年年度报告__1216687349",
    "600500__中化国际__中化国际2022年年度报告__1216663256",
    "603003__龙宇股份__龙宇股份2022年年度报告__1216645157",
    "688538__和辉光电__上海和辉光电股份有限公司2022年年度报告__1216623370"
]
filter_by_interest_bearing_liabilities(file_title_list=file_title_list)
