from db.index import read_table
from service.report import get_operating_revenue
from strategy.announcements.announcements import filter_by_increase_in_accounts_receivable, filter_by_interest_bearing_liabilities, filter_by_proportion_of_accounts_receivable, generate_hblrb, generate_hbzcfzb
# from strategy.announcements.announcements import filter_by_interest_bearing_liabilities
from utils.index import _map, get_path, json

# file_title_list = [
#     "600481__双良节能__双良节能系统股份有限公司2022年年度报告__1216560014",
#     "003005__竞业达__2022年年度报告__1216617405",
#     "301098__金埔园林__2022年年度报告__1216558940",
#     "002500__山西证券__2022年年度报告__1216656433",
#     "002282__博深股份__2022年年度报告__1216648090",
#     "603985__恒润股份__江阴市恒润重工股份有限公司2022年年度报告__1216419056",
#     "002581__未名医药__2022年度报告（更正后）__1217066287",
#     "688227__品高股份__2022年年度报告__1216711726",
#     "601788__光大证券__光大证券股份有限公司2022年年度报告__1216279948",
#     "003040__楚天龙__2022年年度报告__1216275830",
#     "300668__杰恩设计__2022年年度报告__1216517939",
#     "600278__东方创业__东方创业2022年度报告__1216701140",
#     "831305__海希通讯__2022年年度报告（更正后）__1216861207",
#     "300097__智云股份__2022年年度报告（更新后）__1216921699",
#     "603167__渤海轮渡__渤海轮渡集团股份有限公司2022年年度报告__1216441667",
#     "688510__航亚科技__无锡航亚科技股份有限公司2022年年度报告__1216582882",
#     "688288__鸿泉物联__鸿泉物联：2022年年度报告__1216687349",
#     "600500__中化国际__中化国际2022年年度报告__1216663256",
#     "603003__龙宇股份__龙宇股份2022年年度报告__1216645157"
#  ]
# r = read_table(
#     table_name="announcements",
#     fields=["file_title"],
#     result_type="dict",
#     filter_str="where title not like '%英文%' and title not like '%取消%' and title not like '%摘要%' and title like '%2022%' ORDER BY RAND() LIMIT 100",
# )
# file_title_list = _map(r, lambda item: item["file_title"])
file_title_list = [
    "300961__深水海纳__2022年年度报告__1216622457",
    "836260__中寰股份__2022年年度报告__1216492214",
    "300336__新文退__2022年年度报告__1216628903",
    "600351__亚宝药业__亚宝药业2022年年度报告__1216585475", 
    "603529__爱玛科技__爱玛科技集团股份有限公司2022年年度报告__1216418413", 
    "002692__ST远程__2022年年度报告__1216557684", 
    "605066__天正电气__2022年年度报告__1216668935", 
    "600235__民丰特纸__民丰特纸2022年年度报告__1216272737", 
    "002690__美亚光电__2022年年度报告__1216268241", 
    "002393__力生制药__2022年年度报告__1216203513", 
    "688151__华强科技__湖北华强科技股份有限公司2022年年度报告__1216497797",
    "002939__长城证券__2022年年度报告__1216442713", 
    "600561__江西长运__江西长运2022年年度报告__1216478350", 
    "300492__华图山鼎__2022年年度报告__1216624722", 
    "600815__厦工股份__厦工股份2022年年度报告__1216663890", 
    "600781__退市辅仁__600781 辅仁药业集团制药股份有限公司2022年年报__1216706297", 
    "688768__容知日新__容知日新2022年年度报告全文__1216371939", 
    "300925__法本信息__2022年年度报告__1216583706", 
    "600177__雅戈尔__雅戈尔2022年年度报告__1216699948", 
    "300026__红日药业__2022年年度报告__1216274696", 
    "301117__佳缘科技__2022年年度报告__1216492466", 
    "601100__恒立液压__江苏恒立液压股份有限公司2022年年度报告__1216561779", 
    "600423__柳化股份__柳化股份2022年年度报告__1216128508", 
    "000712__锦龙股份__2022年年度报告__1216244549", 
    "000573__粤宏远A__2022年年度报告__1216299891", 
    "600955__维远股份__利华益维远化学股份有限公司2022年年度报告__1216026552", 
    "002004__华邦健康__2022年年度报告__1216612835", 
    "002811__郑中设计__2022年年度报告__1216528462", 
    "605268__王力安防__王力安防2022年年度报告__1216596212", 
    "600475__华光环能__无锡华光环保能源集团股份有限公司2022年年度报告__1216594937", 
    "600590__泰豪科技__2022年年度报告__1216690767", 
    "300045__华力创通__2022年年度报告__1216496633", 
    "601328__交通银行__交通银行2022年度报告__1216276220",  # 表格无边框
    "601117__中国化学__中国化学2022年年度报告__1216234431", 
    "600163__中闽能源__中闽能源2022年年度报告__1216475081", 
    "688048__长光华芯__2022年年度报告__1216596481", 
    "601375__中原证券__中原证券股份有限公司2022年年度报告__1216259984", 
    "002289__ST宇顺__2022年年度报告__1216629358", 
    "603759__海天股份__海天股份2022年年度报告__1216595962", 
    "601717__郑煤机__郑州煤矿机械集团股份有限公司2022年年度报告__1216262611", 
    "688500__*ST慧辰__2022年年度报告（更正版）__1216976054", 
    "002026__山东威达__2022年年度报告__1216548232", 
    "600109__国金证券__国金证券股份有限公司2022年年度报告__1216594786", 
    "603727__博迈科__博迈科海洋工程股份有限公司2022年年度报告__1216517840", 
    "000813__德展健康__2022年年度报告__1216646010", 
    "688571__杭华股份__杭华油墨股份有限公司2022年年度报告__1216454193", 
    "601868__中国能建__中国能源建设股份有限公司2022年年度报告__1216283037", 
    "603886__元祖股份__元祖股份2022年年度报告__1216234495", 
    "000010__美丽生态__2022年年度报告__1216661892", 
    "688621__阳光诺和__北京阳光诺和药物研究股份有限公司2022年年度报告__1216093858", 
    "600766__*ST园城__烟台园城黄金股份有限公司2022年年度报告__1216705989", 
    "300041__回天新材__2022年年度报告（更正后）__1216475069",
    "601882__海天精工__宁波海天精工股份有限公司2022年年度报告__1216166565", 
    "603678__火炬电子__火炬电子2022年年度报告__1216180075", 
    "688169__石头科技__北京石头世纪科技股份有限公司2022年年度报告__1216616710", 
    "301306__西测测试__2022年年度报告__1216579206", 
    "688192__迪哲医药__迪哲医药：2022年年度报告__1216202199", 
    "300673__佩蒂股份__2022年年度报告__1216561156", 
    "000096__广聚能源__2022年年度报告__1216438315", 
    "301106__骏成科技__2022年年度报告（更正后）__1216234185", 
    "300710__万隆光电__杭州万隆光电设备股份有限公司2022年年度报告（更新后）__1216616546", 
    "601881__中国银河__中国银河：2022年年度报告__1216263010",  # 表格无边框
    "002496__辉丰股份__2022年年度报告__1216650364", 
    "688063__派能科技__上海派能能源科技股份有限公司2022年年度报告__1216381410", 
    "300677__英科医疗__2022年年度报告__1216651766", 
    "688367__工大高科__工大高科2022年年度报告__1216623285", 
    "688685__迈信林__江苏迈信林航空科技股份有限公司2022年年度报告__1216643566", 
    "002103__广博股份__2022年年度报告__1216516159", 
    "605068__明新旭腾__明新旭腾2022年年度报告__1216498642", 
    "600581__八一钢铁__八一钢铁2022年年度报告全文__1216437215", 
    "600265__ST景谷__2022年年度报告__1216644551", 
    "688289__圣湘生物__圣湘生物科技股份有限公司2022年年度报告全文__1216457616", 
    "300011__鼎汉技术__2022年年度报告__1216320564", 
    "601886__江河集团__江河集团2022年度报告全文__1216245640", 
    "603587__地素时尚__地素时尚2022年年度报告__1216666879", 
    "600258__首旅酒店__北京首旅酒店（集团）股份有限公司2022年年度报告__1216281484", 
    "688057__金达莱__2022年年度报告__1216657699", 
    "600769__祥龙电业__武汉祥龙电业股份有限公司2022年年度报告__1216523672", 
    "603095__越剑智能__2022年年度报告__1216410403", 
    "600960__渤海汽车__渤海汽车2022年年度报告__1216626374", 
    "605006__山东玻纤__605006_山东玻纤集团股份有限公司2022年年度报告__1216442345", 
    "688234__天岳先进__山东天岳先进科技股份有限公司2022年年度报告__1216631018", 
    "688510__航亚科技__无锡航亚科技股份有限公司2022年年度报告__1216582882", 
    "688265__南模生物__2022年年度报告__1216671531", # 无利润表
    "688179__阿拉丁__阿拉丁2022年年度报告__1216582019", 
    "000668__荣丰控股__2022年年度报告__1216663264", 
    "000971__ST高升__2022年年度报告__1216657361", 
    "688106__金宏气体__金宏气体：2022年年度报告__1216381659", 
    "002041__登海种业__2022年年度报告__1216557215", 
    "000078__海王生物__2022年年度报告__1216662203", 
    "000606__顺利退__2022年年度报告__1216703249", 
    "000651__格力电器__2022年年度报告__1216702261", 
    "300645__正元智慧__2022年年度报告__1216612351", 
    "301023__江南奕帆__2022年年度报告__1216656613", 
    "002085__万丰奥威__2022年年度报告__1216552130", 
    "688229__博睿数据__公司2022年年度报告__1216622927", 
    "301187__欧圣电气__2022年年度报告__1216419306", 
    "603629__利通电子__603629：利通电子2022年年度报告__1216590988", 
    "300424__航新科技__2022年年度报告__1216623707", 
    "837663__明阳科技__2022年年度报告（更正后）__1216810790" 
]

# file_title_list = [
#     "605056__咸亨国际__咸亨国际：2022年年度报告__1216478420",
#     # "600123__兰花科创__兰花科创2022年度报告全文__1216554351", # 应收款项不在合并资产负债表中，而在“1. 资产及负债状况 ”子表中
#     "600392__盛和资源__盛和资源2022年年度报告__1216689975", # 合并资产负债表边框有开口导致无法解析出总资产
#     # "836433__大唐药业__2022年年度报告__1216619159", # 边框颜色导致无法识别合并资产负债表、合并利润表
#     "688778__厦钨新能__厦门厦钨新能源材料股份有限公司2022年年度报告__1216520043", # 134-1，135-1，136-1未识别为同一张表
#     "688121__卓然股份__2022年年度报告（修订版）__1217053279" # 129-1,130-1,131-1未识别为同一张表

# ]

# filter_by_interest_bearing_liabilities(file_title_list)
# filter_by_proportion_of_accounts_receivable(file_title_list)

# for file_title in file_title_list:
#     hblrb_url = f"{STATIC_ANNOUNCEMENTS_HBLRB_DIR}/{file_title}__{Financial_Statement.合并利润表.value}.json"
#     hbzcfzb_url = f"{STATIC_ANNOUNCEMENTS_HBZCFZB_DIR}/{file_title}__{Financial_Statement.合并资产负债表.value}.json"
#     r1 = json(hblrb_url)
#     r2 = json(hbzcfzb_url)
    # operating_revenue_result = get_operating_revenue(r)
    # current_operating_revenue = operating_revenue_result[0]
    # growth_rate = operating_revenue_result[1]
    # print(f"{file_title}的当期营业收入为：{current_operating_revenue}")
    # print(f"营业收入增长率为：{growth_rate}%")
    # print(get_accounts_receivable(r2))
    # print(get_operating_revenue(r1))

# generate_hbzcfzb(file_title_list)
# generate_hblrb(file_title_list)
x = filter_by_increase_in_accounts_receivable(file_title_list)
# print(x)

